---
kind: type
id: T:Autodesk.Revit.DB.BRepBuilderEdgeGeometry
source: html/b0051e1b-8b8b-f819-78c2-67053dd7a241.htm
---
# Autodesk.Revit.DB.BRepBuilderEdgeGeometry

An abstract class used by BRepBuilder to represent the geometry of an edge. Specific edge-geometry representations are represented by subclasses.

## Syntax (C#)
```csharp
public class BRepBuilderEdgeGeometry : IDisposable
```